In [125]:
d={'name':['adi','om','kunal','rahul','karn'],
  'age':[22,23,21,20,24],
   'salary':[22000,23000,27000,20000,25000]}

In [126]:
pip install pandas

Requirement already satisfied: pandas in c:\users\hplap\appdata\local\programs\python\python311\lib\site-packages (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hplap\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\hplap\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\hplap\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\hplap\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\hplap\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3.1 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [127]:
import pandas as pd

In [128]:
d={'name':['adi','om','kunal','rahul','karn'],
  'age':[22,23,21,20,24],
   'salary':[22000,23000,27000,20000,25000]}

In [129]:
pd.DataFrame(data=d)

    name  age  salary
0    adi   22   22000
1     om   23   23000
2  kunal   21   27000
3  rahul   20   20000
4   karn   24   25000

In [130]:
a=pd.DataFrame(data=data)

In [131]:
a

    name  age  salary
0    adi   22   22000
1     om   23   23000
2  kunal   21   27000
3  rahul   20   20000
4   karn   24   25000

In [132]:
print(type(a))

<class 'pandas.core.frame.DataFrame'>

In [133]:
a.shape

(5, 3)

In [134]:
a.size

15

In [135]:
a.info()
a.ndim

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   salary  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

2

In [136]:
b=pd.Series([12,34,56,48])
b

0    12
1    34
2    56
3    48
dtype: int64

In [137]:
b.ndim

1

In [138]:
df1=pd.read_csv(r"C:\Users\hplap\Downloads\Itvedant\python\Compnies.csv")

In [139]:
df1

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,"611,289",6.7%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,"513,983",9.4%,"1,540,000","Seattle, Washington"
2,3,ExxonMobil,Petroleum industry,"413,680",44.8%,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,"394,328",7.8%,"164,000","Cupertino, California"
4,5,UnitedHealth Group,Healthcare,"324,162",12.7%,"400,000","Minnetonka, Minnesota"
...,...,...,...,...,...,...,...
95,96,Best Buy,Retail,"46,298",10.6%,"71,100","Richfield, Minnesota"
96,97,Bristol-Myers Squibb,Pharmaceutical industry,"46,159",0.5%,"34,300","New York City, New York"
97,98,United Airlines,Airline,"44,955",82.5%,"92,795","Chicago, Illinois"
98,99,Thermo Fisher Scientific,Laboratory instruments,"44,915",14.5%,"130,000","Waltham, Massachusetts"
99,100,Qualcomm,Technology,"44,200",31.7%,"51,000","San Diego, California"

In [140]:
df1.shape

(100, 7)

In [141]:
df1.columns

Index(['Rank', 'Name', 'Industry', 'Revenue (USD millions)', 'Revenue growth',
       'Employees', 'Headquarters'],
      dtype='object')

In [142]:
df1['Rank']

0       1
1       2
2       3
3       4
4       5
     ...
95     96
96     97
97     98
98     99
99    100
Name: Rank, Length: 100, dtype: int64

In [143]:
df1['Industry']

0                         Retail
1     Retail and cloud computing
2             Petroleum industry
3           Electronics industry
4                     Healthcare
                 ...
95                        Retail
96       Pharmaceutical industry
97                       Airline
98        Laboratory instruments
99                    Technology
Name: Industry, Length: 100, dtype: object

In [144]:
df1[['Rank','Name']]

    Rank                      Name
0      1                   Walmart
1      2                    Amazon
2      3                ExxonMobil
3      4                     Apple
4      5        UnitedHealth Group
..   ...                       ...
95    96                  Best Buy
96    97      Bristol-Myers Squibb
97    98           United Airlines
98    99  Thermo Fisher Scientific
99   100                  Qualcomm

[100 rows x 2 columns]

In [145]:
df1.loc[0]

Rank                                          1
Name                                    Walmart
Industry                                 Retail
Revenue (USD millions)                  611,289
Revenue growth                             6.7%
Employees                             2,100,000
Headquarters              Bentonville, Arkansas
Name: 0, dtype: object

In [146]:
df1.loc[1]

Rank                                               2
Name                                          Amazon
Industry                  Retail and cloud computing
Revenue (USD millions)                       513,983
Revenue growth                                  9.4%
Employees                                  1,540,000
Headquarters                     Seattle, Washington
Name: 1, dtype: object

In [147]:
df1.loc[3]

Rank                                          4
Name                                      Apple
Industry                   Electronics industry
Revenue (USD millions)                  394,328
Revenue growth                             7.8%
Employees                               164,000
Headquarters              Cupertino, California
Name: 3, dtype: object

In [148]:
df1.loc[1:3]

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
1,2,Amazon,Retail and cloud computing,"513,983",9.4%,"1,540,000","Seattle, Washington"
2,3,ExxonMobil,Petroleum industry,"413,680",44.8%,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,"394,328",7.8%,"164,000","Cupertino, California"

In [149]:
df1.iloc[0]

Rank                                          1
Name                                    Walmart
Industry                                 Retail
Revenue (USD millions)                  611,289
Revenue growth                             6.7%
Employees                             2,100,000
Headquarters              Bentonville, Arkansas
Name: 0, dtype: object

In [150]:
df1.iloc[1]

Rank                                               2
Name                                          Amazon
Industry                  Retail and cloud computing
Revenue (USD millions)                       513,983
Revenue growth                                  9.4%
Employees                                  1,540,000
Headquarters                     Seattle, Washington
Name: 1, dtype: object

In [151]:
df1.iloc[1:3]

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
1,2,Amazon,Retail and cloud computing,"513,983",9.4%,"1,540,000","Seattle, Washington"
2,3,ExxonMobil,Petroleum industry,"413,680",44.8%,"62,000","Spring, Texas"

In [152]:
df1.iloc[::-1]

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
99,100,Qualcomm,Technology,"44,200",31.7%,"51,000","San Diego, California"
98,99,Thermo Fisher Scientific,Laboratory instruments,"44,915",14.5%,"130,000","Waltham, Massachusetts"
97,98,United Airlines,Airline,"44,955",82.5%,"92,795","Chicago, Illinois"
96,97,Bristol-Myers Squibb,Pharmaceutical industry,"46,159",0.5%,"34,300","New York City, New York"
95,96,Best Buy,Retail,"46,298",10.6%,"71,100","Richfield, Minnesota"
...,...,...,...,...,...,...,...
4,5,UnitedHealth Group,Healthcare,"324,162",12.7%,"400,000","Minnetonka, Minnesota"
3,4,Apple,Electronics industry,"394,328",7.8%,"164,000","Cupertino, California"
2,3,ExxonMobil,Petroleum industry,"413,680",44.8%,"62,000","Spring, Texas"
1,2,Amazon,Retail and cloud computing,"513,983",9.4%,"1,540,000","Seattle, Washington"
0,1,Walmart,Retail,"611,289",6.7%,"2,100,000","Bentonville, Arkansas"

In [153]:
df1.iloc[[1:3,3:5]]

SyntaxError: invalid syntax (1529729043.py, line 1)

In [ ]:
df1.iloc[1:3,3:5]

  Revenue (USD millions) Revenue growth
1                513,983           9.4%
2                413,680          44.8%

In [ ]:
df1.loc[1:3,3:5] # loc is used for only row so it is not run

TypeError: cannot do slice indexing on Index with these indexers [3] of type int

In [ ]:
df1.head()

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,"611,289",6.7%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,"513,983",9.4%,"1,540,000","Seattle, Washington"
2,3,ExxonMobil,Petroleum industry,"413,680",44.8%,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,"394,328",7.8%,"164,000","Cupertino, California"
4,5,UnitedHealth Group,Healthcare,"324,162",12.7%,"400,000","Minnetonka, Minnesota"

In [ ]:
df1.tail()

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
95,96,Best Buy,Retail,"46,298",10.6%,"71,100","Richfield, Minnesota"
96,97,Bristol-Myers Squibb,Pharmaceutical industry,"46,159",0.5%,"34,300","New York City, New York"
97,98,United Airlines,Airline,"44,955",82.5%,"92,795","Chicago, Illinois"
98,99,Thermo Fisher Scientific,Laboratory instruments,"44,915",14.5%,"130,000","Waltham, Massachusetts"
99,100,Qualcomm,Technology,"44,200",31.7%,"51,000","San Diego, California"

In [ ]:
df1.head(3)

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,"611,289",6.7%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,"513,983",9.4%,"1,540,000","Seattle, Washington"
2,3,ExxonMobil,Petroleum industry,"413,680",44.8%,"62,000","Spring, Texas"

In [ ]:
df1.tail(3)

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
97,98,United Airlines,Airline,"44,955",82.5%,"92,795","Chicago, Illinois"
98,99,Thermo Fisher Scientific,Laboratory instruments,"44,915",14.5%,"130,000","Waltham, Massachusetts"
99,100,Qualcomm,Technology,"44,200",31.7%,"51,000","San Diego, California"

In [ ]:
df1.columns

Index(['Rank', 'Name', 'Industry', 'Revenue (USD millions)', 'Revenue growth',
       'Employees', 'Headquarters'],
      dtype='object')

In [ ]:
df1.to_string()

"    Rank                                 Name                            Industry Revenue (USD millions) Revenue growth  Employees                                Headquarters\n0      1                              Walmart                              Retail                611,289           6.7%  2,100,000                       Bentonville, Arkansas\n1      2                               Amazon          Retail and cloud computing                513,983           9.4%  1,540,000                         Seattle, Washington\n2      3                           ExxonMobil                  Petroleum industry                413,680          44.8%     62,000                               Spring, Texas\n3      4                                Apple                Electronics industry                394,328           7.8%    164,000                       Cupertino, California\n4      5                   UnitedHealth Group                          Healthcare                324,162          12.7%    400,000                       Minnetonka, Minnesota\n5      6                           CVS Health                          Healthcare                322,467          10.4%    259,500                    Woonsocket, Rhode Island\n6      7                   Berkshire Hathaway                        Conglomerate                302,089           9.4%    383,000                             Omaha, Nebraska\n7      8                             Alphabet      Technology and cloud computing                282,836           9.8%    156,000                   Mountain View, California\n8      9                 McKesson Corporation                              Health                276,711           4.8%     48,500                               Irving, Texas\n9     10                  Chevron Corporation                  Petroleum industry                246,252          51.6%     43,846                       San Ramon, California\n10    11                              Cencora                  Pharmacy wholesale                238,587          11.5%     41,500                  Chesterbrook, Pennsylvania\n11    12                               Costco                              Retail                226,954          15.8%    304,000                        Issaquah, Washington\n12    13                            Microsoft      Technology and cloud computing                198,270          18.0%    221,000                         Redmond, Washington\n13    14                      Cardinal Health                          Healthcare                181,364          11.6%     46,035                                Dublin, Ohio\n14    15                                Cigna                    Health insurance                180,516           3.7%     70,231                     Bloomfield, Connecticut\n15    16                   Marathon Petroleum                  Petroleum industry                180,012          27.6%     17,800                               Findlay, Ohio\n16    17                          Phillips 66                  Petroleum industry                175,702          53.0%     13,000                              Houston, Texas\n17    18                        Valero Energy                  Petroleum industry                171,189          58.0%      9,743                          San Antonio, Texas\n18    19                   Ford Motor Company                 Automotive industry                158,057          15.9%    173,000                          Dearborn, Michigan\n19    20                       The Home Depot                              Retail                157,403           4.1%    471,600                            Atlanta, Georgia\n20    21                       General Motors                 Automotive industry                156,735          23.4%    167,000                           Detroit, Michigan\n21    22                      Elevance Health                          Healthcare                156,595          13.0%    102,200                       Indianapolis, Indiana\n22    23                       JPMorgan Chase                  Financial services                154,792          21.7%    293,723                     New York City, New York\n23    24                               Kroger                              Retail                148,258           7.5%    430,000                            Cincinnati, Ohio\n24    25                              Centene                          Healthcare                144,547          14.7%     74,300                         St. Louis, Missouri\n25    26               Verizon Communications                  Telecommunications                136,835           2.4%    117,100                     New York City, New York\n26    27             Walgreens Boots Alliance             Pharmaceutical industry                132,703          10.7%    262,500                         Deerfield, Illinois\n27    28                           Fannie Mae                          Financials                121,596          19.7%      8,000                            Washington, D.C.\n28    29                              Comcast                  Telecommunications                121,427           4.3%    186,000                  Philadelphia, Pennsylvania\n29    30                                 AT&T  Conglomerate and telecomunications                120,741          28.5%    160,700                               Dallas, Texas\n30    31                       Meta Platforms                          Technology                116,609           1.1%     86,482                      Menlo Park, California\n31    32                      Bank of America                          Financials                115,053          22.6%    216,823                   Charlotte, North Carolina\n32    33                   Target Corporation                              Retail                109,120           2.9%    440,000                      Minneapolis, Minnesota\n33    34                    Dell Technologies                          Technology                102,301           4.4%    133,000                           Round Rock, Texas\n34    35               Archer Daniels Midland                       Food industry                101,556          19.1%     41,181                           Chicago, Illinois\n35    36                            Citigroup                          Financials                101,078          26.6%    238,104                     New York City, New York\n36    37                United Parcel Service                      Transportation                100,338           3.1%    404,700                            Atlanta, Georgia\n37    38                               Pfizer             Pharmaceutical industry                100,330          23.4%     83,000                     New York City, New York\n38    39                               Lowe's                              Retail                 97,059           0.8%    244,500                 Mooresville, North Carolina\n39    40                    Johnson & Johnson             Pharmaceutical industry                 94,943           1.2%    152,700                   New Brunswick, New Jersey\n40    41                                FedEx                      Transportation                 93,512          11.4%    518,249                          Memphis, Tennessee\n41    42                               Humana                    Health insurance                 92,870          11.8%     67,100                        Louisville, Kentucky\n42    43             Energy Transfer Partners                  Petroleum industry                 89,876          33.3%     12,565                               Dallas, Texas\n43    44                           State Farm                          Financials                 89,328           8.6%     60,519                       Bloomington, Illinois\n44    45                          Freddie Mac                          Financials                 86,717          31.6%      7,819                            McLean, Virginia\n45    46                              PepsiCo                            Beverage                 86,859           8.7%    315,000                          Purchase, New York\n46    47                          Wells Fargo                          Financials                 82,859           0.5%    238,000                   San Francisco, California\n47    48              The Walt Disney Company                               Media                 82,722          22.7%    195,800                         Burbank, California\n48    49                       ConocoPhillips                  Petroleum industry                 82,156          69.9%      9,500                              Houston, Texas\n49    50                                Tesla               Automotive and energy                 81,462          51.4%    127,855                               Austin, Texas\n50    51                     Procter & Gamble     Consumer products manufacturing                 80,187           5.3%    106,000                            Cincinnati, Ohio\n51    52         United States Postal Service                           Logistics                 78,620           2.0%    576,000                            Washington, D.C.\n52    53                           Albertsons                              Retail                 77,650           8.0%    198,650                                Boise, Idaho\n53    54                     General Electric                        Conglomerate                 76,555           3.2%    172,000                       Boston, Massachusetts\n54    55                              MetLife                          Financials                 69,898           1.7%     45,000                     New York City, New York\n55    56                        Goldman Sachs                          Financials                 68,711           5.7%     48,500                     New York City, New York\n56    57                                Sysco                        Food service                 68,636          33.8%     70,510                              Houston, Texas\n57    58                        Bunge Limited                       Food industry                 67,232          13.7%     23,000                      White Plains, New York\n58    59                      RTX Corporation                        Conglomerate                 67,074           4.2%    182,000                  Arlington County, Virginia\n59    60                               Boeing               Aerospace and defense                 66,608           6.9%    156,000                  Arlington County, Virginia\n60    61                         StoneX Group                          Financials                 66,036          55.3%   4,000[2]                     New York City, New York\n61    62                      Lockheed Martin               Aerospace and defense                 65,984           1.6%    116,000                          Bethesda, Maryland\n62    63                       Morgan Stanley                          Financials                 65,936           7.9%     82,427                     New York City, New York\n63    64                                Intel                          Technology                 63,054          20.1%    131,900                     Santa Clara, California\n64    65                                   HP                          Technology                 62,983           0.8%     58,000                       Palo Alto, California\n65    66                            TD Synnex                            Infotech                 62,344          97.2%     28,500                         Clearwater, Florida\n66    67                                  IBM      Technology and cloud computing                 60,530          16.3%    303,100                            Armonk, New York\n67    68                       HCA Healthcare                          Healthcare                 60,233           2.5%    250,500                        Nashville, Tennessee\n68    69                 Prudential Financial                          Financials                 60,050          15.3%     39,583                          Newark, New Jersey\n69    70                          Caterpillar                           Machinery                 59,427          16.6%    109,100                         Deerfield, Illinois\n70    71                          Merck & Co.             Pharmaceutical industry                 59,283          15.8%     68,000                      Kenilworth, New Jersey\n71    72                  World Fuel Services    Petroleum industry and logistics                 59,043          88.4%      5,214                              Miami, Florida\n72    73      New York Life Insurance Company                           Insurance                 58,445          14.2%     15,050                     New York City, New York\n73    74                  Enterprise Products                  Petroleum industry                 58,186          42.6%      7,300                              Houston, Texas\n74    75                               AbbVie             Pharmaceutical industry                 58,054           3.3%     50,000                        Lake Bluff, Illinois\n75    76         Plains All American Pipeline                  Petroleum industry                 57,342          36.3%      4,100                              Houston, Texas\n76    77                 Dow Chemical Company                   Chemical industry                 56,902           3.5%     37,800                           Midland, Michigan\n77    78                                  AIG                           Insurance                 56,437           8.4%     26,200                     New York City, New York\n78    79                     American Express                           Financial                 55,625          27.3%     77,300                     New York City, New York\n79    80                               Publix                              Retail                 54,942          13.5%    242,000                           Lakeland, Florida\n80    81               Charter Communications                  Telecommunications                 54,022           4.5%    101,700                       Stamford, Connecticut\n81    82                          Tyson Foods                     Food processing                 53,282          13.2%    142,000                        Springdale, Arkansas\n82    83                           John Deere           Agriculture manufacturing                 52,577          19.4%     82,239                            Moline, Illinois\n83    84                                Cisco      Telecom hardware manufacturing                 51,557           3.5%     83,300                        San Jose, California\n84    85  Nationwide Mutual Insurance Company                           Financial                 51,450           8.6%     24,791                              Columbus, Ohio\n85    86                             Allstate                           Insurance                 51,412           3.4%     54,250  Northfield Township, Cook County, Illinois\n86    87                      Delta Air Lines                             Airline                 50,582          69.2%     95,000                            Atlanta, Georgia\n87    88                       Liberty Mutual                           Insurance                 49,956           3.6%     50,000                       Boston, Massachusetts\n88    89                                  TJX                              Retail                 49,936           2.9%    329,000                   Framingham, Massachusetts\n89    90              Progressive Corporation                           Insurance                 49,611           4.0%     55,063                      Mayfield Village, Ohio\n90    91                    American Airlines                             Airline                 48,971          63.9%    129,700                           Fort Worth, Texas\n91    92                                  CHS             Agriculture cooperative                 47,194          24.3%     10,014              Inver Grove Heights, Minnesota\n92    93               Performance Food Group                     Food processing                 47,194          61.6%     34,825                          Richmond, Virginia\n93    94                           PBF Energy                  Petroleum industry                 46,830          71.8%      3,616           Parsippany–Troy Hills, New Jersey\n94    95                                 Nike                             Apparel                 46,710           4.9%     79,100                           Beaverton, Oregon\n95    96                             Best Buy                              Retail                 46,298          10.6%     71,100                        Richfield, Minnesota\n96    97                 Bristol-Myers Squibb             Pharmaceutical industry                 46,159           0.5%     34,300                     New York City, New York\n97    98                      United Airlines                             Airline                 44,955          82.5%     92,795                           Chicago, Illinois\n98    99             Thermo Fisher Scientific              Laboratory instruments                 44,915          14.5%    130,000                      Waltham, Massachusetts\n99   100                             Qualcomm                          Technology                 44,200          31.7%     51,000                       San Diego, California"

In [ ]:
list(list(df1.columns))

['Rank',
 'Name',
 'Industry',
 'Revenue (USD millions)',
 'Revenue growth',
 'Employees',
 'Headquarters']

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Rank                    100 non-null    int64
 1   Name                    100 non-null    object
 2   Industry                100 non-null    object
 3   Revenue (USD millions)  100 non-null    object
 4   Revenue growth          100 non-null    object
 5   Employees               100 non-null    object
 6   Headquarters            100 non-null    object
dtypes: int64(1), object(6)
memory usage: 5.6+ KB

In [ ]:
df1

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,"611,289",6.7%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,"513,983",9.4%,"1,540,000","Seattle, Washington"
2,3,ExxonMobil,Petroleum industry,"413,680",44.8%,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,"394,328",7.8%,"164,000","Cupertino, California"
4,5,UnitedHealth Group,Healthcare,"324,162",12.7%,"400,000","Minnetonka, Minnesota"
...,...,...,...,...,...,...,...
95,96,Best Buy,Retail,"46,298",10.6%,"71,100","Richfield, Minnesota"
96,97,Bristol-Myers Squibb,Pharmaceutical industry,"46,159",0.5%,"34,300","New York City, New York"
97,98,United Airlines,Airline,"44,955",82.5%,"92,795","Chicago, Illinois"
98,99,Thermo Fisher Scientific,Laboratory instruments,"44,915",14.5%,"130,000","Waltham, Massachusetts"
99,100,Qualcomm,Technology,"44,200",31.7%,"51,000","San Diego, California"

In [ ]:
df1.describe()

             Rank
count  100.000000
mean    50.500000
std     29.011492
min      1.000000
25%     25.750000
50%     50.500000
75%     75.250000
max    100.000000

In [ ]:
df1["Name"]

0                      Walmart
1                       Amazon
2                   ExxonMobil
3                        Apple
4           UnitedHealth Group
                ...
95                    Best Buy
96        Bristol-Myers Squibb
97             United Airlines
98    Thermo Fisher Scientific
99                    Qualcomm
Name: Name, Length: 100, dtype: object

In [ ]:
df1[["Name"]]

                        Name
0                    Walmart
1                     Amazon
2                 ExxonMobil
3                      Apple
4         UnitedHealth Group
..                       ...
95                  Best Buy
96      Bristol-Myers Squibb
97           United Airlines
98  Thermo Fisher Scientific
99                  Qualcomm

[100 rows x 1 columns]

In [ ]:
df1.isnull().sum()

Rank                      0
Name                      0
Industry                  0
Revenue (USD millions)    0
Revenue growth            0
Employees                 0
Headquarters              0
dtype: int64

In [ ]:
df1.duplicated()

0     False
1     False
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Length: 100, dtype: bool

In [ ]:
df1.duplicated().sum()

0

In [ ]:
df1.dropna() # removing null value

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,"611,289",6.7%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,"513,983",9.4%,"1,540,000","Seattle, Washington"
2,3,ExxonMobil,Petroleum industry,"413,680",44.8%,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,"394,328",7.8%,"164,000","Cupertino, California"
4,5,UnitedHealth Group,Healthcare,"324,162",12.7%,"400,000","Minnetonka, Minnesota"
...,...,...,...,...,...,...,...
95,96,Best Buy,Retail,"46,298",10.6%,"71,100","Richfield, Minnesota"
96,97,Bristol-Myers Squibb,Pharmaceutical industry,"46,159",0.5%,"34,300","New York City, New York"
97,98,United Airlines,Airline,"44,955",82.5%,"92,795","Chicago, Illinois"
98,99,Thermo Fisher Scientific,Laboratory instruments,"44,915",14.5%,"130,000","Waltham, Massachusetts"
99,100,Qualcomm,Technology,"44,200",31.7%,"51,000","San Diego, California"

df1.fillna() # replace value

df1.replace('?', mode)# null value replace with mode

df.replace(NaN,mean)

In [ ]:
df1.drop_duplicates()

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,"611,289",6.7%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,"513,983",9.4%,"1,540,000","Seattle, Washington"
2,3,ExxonMobil,Petroleum industry,"413,680",44.8%,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,"394,328",7.8%,"164,000","Cupertino, California"
4,5,UnitedHealth Group,Healthcare,"324,162",12.7%,"400,000","Minnetonka, Minnesota"
...,...,...,...,...,...,...,...
95,96,Best Buy,Retail,"46,298",10.6%,"71,100","Richfield, Minnesota"
96,97,Bristol-Myers Squibb,Pharmaceutical industry,"46,159",0.5%,"34,300","New York City, New York"
97,98,United Airlines,Airline,"44,955",82.5%,"92,795","Chicago, Illinois"
98,99,Thermo Fisher Scientific,Laboratory instruments,"44,915",14.5%,"130,000","Waltham, Massachusetts"
99,100,Qualcomm,Technology,"44,200",31.7%,"51,000","San Diego, California"

In [ ]:
d1={'Days':['day1','day2','day3','day4'],
    'Cal':[130,150,120,140],
    'Date':['23/06/2024','24/06/2024','25/06/2024','26/06/2024']}

In [ ]:
df2=pd.DataFrame(data=d1)
df2

   Days  Cal        Date
0  day1  130  23/06/2024
1  day2  150  24/06/2024
2  day3  120  25/06/2024
3  day4  140  26/06/2024

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Days    4 non-null      object
 1   Cal     4 non-null      int64
 2   Date    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [ ]:
df2['Date'].to_numpy()# convert into numpy array

array(['23/06/2024', '24/06/2024', '25/06/2024', '26/06/2024'],
      dtype=object)

In [ ]:
df2['Date']=pd.to_datetime(df2['Date']) # change the datatype to data  from string to datetime

C:\Users\hplap\AppData\Local\Temp\ipykernel_5416\1678922165.py:1: UserWarning: Parsing dates in %d/%m/%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df2['Date']=pd.to_datetime(df2['Date'])

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Days    4 non-null      object
 1   Cal     4 non-null      int64
 2   Date    4 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 228.0+ bytes

In [ ]:
df2

   Days  Cal       Date
0  day1  130 2024-06-23
1  day2  150 2024-06-24
2  day3  120 2024-06-25
3  day4  140 2024-06-26

In [ ]:
df2.reset_index()

   index  Days  Cal       Date
0      0  day1  130 2024-06-23
1      1  day2  150 2024-06-24
2      2  day3  120 2024-06-25
3      3  day4  140 2024-06-26

In [179]:
df2.reset_index(inplace=True)
df2

   index  Days  Cal        Date
0      0  day1  130  23/06/2024
1      1  day2  150  24/06/2024
2      2  day3  120  25/06/2024
3      3  day4  140  26/06/2024

In [162]:
d1={'Days':['day1','day2','day3','day4'],
    'Cal':[130,150,120,140],
    'Date':['23/06/2024','24/06/2024','25/06/2024','26/06/2024']}

In [177]:
df3=pd.DataFrame(data=d1,index=['mon','tue','wed','thu'])
df3

     Days  Cal        Date
mon  day1  130  23/06/2024
tue  day2  150  24/06/2024
wed  day3  120  25/06/2024
thu  day4  140  26/06/2024

In [176]:
df2

   Days  Cal        Date
0  day1  130  23/06/2024
1  day2  150  24/06/2024
2  day3  120  25/06/2024
3  day4  140  26/06/2024

In [180]:
df2.drop('index',axis=1,inplace=True)
df2

   Days  Cal        Date
0  day1  130  23/06/2024
1  day2  150  24/06/2024
2  day3  120  25/06/2024
3  day4  140  26/06/2024

In [186]:
L=[21,23,20,22]
df2['Age']=L

In [187]:
df2

   Days  Cal        Date  Age
0  day1  130  23/06/2024   21
1  day2  150  24/06/2024   23
2  day3  120  25/06/2024   20
3  day4  140  26/06/2024   22

In [188]:
df2

   Days  Cal        Date  Age
0  day1  130  23/06/2024   21
1  day2  150  24/06/2024   23
2  day3  120  25/06/2024   20
3  day4  140  26/06/2024   22

In [189]:
df2['Age']>21

0    False
1     True
2    False
3     True
Name: Age, dtype: bool

In [190]:
df2[df2['Age']>21]

   Days  Cal        Date  Age
1  day2  150  24/06/2024   23
3  day4  140  26/06/2024   22

In [191]:
df2[df2['Age']==20]

   Days  Cal        Date  Age
2  day3  120  25/06/2024   20

In [193]:
file=pd.read_csv(r"C:\Users\hplap\Downloads\Itvedant\python\Salary_dataset.csv")

In [194]:
file

    Unnamed: 0  YearsExperience    Salary
0            0              1.2   39344.0
1            1              1.4   46206.0
2            2              1.6   37732.0
3            3              2.1   43526.0
4            4              2.3   39892.0
5            5              3.0   56643.0
6            6              3.1   60151.0
7            7              3.3   54446.0
8            8              3.3   64446.0
9            9              3.8   57190.0
10          10              4.0   63219.0
11          11              4.1   55795.0
12          12              4.1   56958.0
13          13              4.2   57082.0
14          14              4.6   61112.0
15          15              5.0   67939.0
16          16              5.2   66030.0
17          17              5.4   83089.0
18          18              6.0   81364.0
19          19              6.1   93941.0
20          20              6.9   91739.0
21          21              7.2   98274.0
22          22              8.0  101303.0
23          23              8.3  113813.0
24          24              8.8  109432.0
25          25              9.1  105583.0
26          26              9.6  116970.0
27          27              9.7  112636.0
28          28             10.4  122392.0
29          29             10.6  121873.0

: